#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.27e84539.js"]: Refreshing state... [id=thalia-thadmin-staging/js/chunk-vendors.27e84539.js]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.e8290908.js"]: Refreshing state... [id=thalia-thadmin-staging/js/app.e8290908.js]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/499.79b08790.js"]: Refreshing state... [id=thalia-thadmin-staging/js/499.79b08790.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.bd40d1d7.css"]: Refreshing state... [id=thalia-thadmin-staging/css/chunk-vendors.bd40d1d7.css]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.e8290908.js.map"]: Refreshing state... [id=thalia-thadmin-staging/js/app.e8290908.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.3dadf1fd.css"]: Refreshing state... [id=css/app.3dadf1fd.css]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.27e84539.js.map"]: Refreshing state... [id=thalia-thadmin-staging/js/chunk-vendors.27e84539.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/499.79b08790.js.map"]: Refreshing state... [id=thalia-thadmin-staging/js/499.79b08790.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag                   = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                     = "img/backgroundImage.24f22a44.jpg"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag                   = "cee1d78fec8093f15e451fed4547a169" -> "8aafc274e7a1115704d9e81bb53c74f2"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/499.1480f83d.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "804526fc25c56a6c2549321a4e7ddfe3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/499.1480f83d.js"
      + kms_key_id             = (known after apply)
      + region                 = "eu-west-1"
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/499.1480f83d.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/499.1480f83d.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e85a2fd9f5bcb2faccd04f96e9e606ed"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/499.1480f83d.js.map"
      + kms_key_id             = (known after apply)
      + region                 = "eu-west-1"
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/499.1480f83d.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/499.79b08790.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - arn                    = "arn:aws:s3:::thalia-thadmin-staging/js/499.79b08790.js" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "859abcc896de314b5a95ad003d8e2a78" -> null
      - force_destroy          = false -> null
      - id                     = "thalia-thadmin-staging/js/499.79b08790.js" -> null
      - key                    = "js/499.79b08790.js" -> null
      - metadata               = {} -> null
      - region                 = "eu-west-1" -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/499.79b08790.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/499.79b08790.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - arn                    = "arn:aws:s3:::thalia-thadmin-staging/js/499.79b08790.js.map" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "3c3cce2a224fdd3a74742bef15883002" -> null
      - force_destroy          = false -> null
      - id                     = "thalia-thadmin-staging/js/499.79b08790.js.map" -> null
      - key                    = "js/499.79b08790.js.map" -> null
      - metadata               = {} -> null
      - region                 = "eu-west-1" -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/499.79b08790.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.a801d514.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "6464e60ac4d4201458298a227f1376c8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.a801d514.js"
      + kms_key_id             = (known after apply)
      + region                 = "eu-west-1"
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.a801d514.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.a801d514.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e20f7c9bc7e324f5571e513ff68a24ba"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.a801d514.js.map"
      + kms_key_id             = (known after apply)
      + region                 = "eu-west-1"
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.a801d514.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.e8290908.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - arn                    = "arn:aws:s3:::thalia-thadmin-staging/js/app.e8290908.js" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "107f293107274f5b309fb9ebb068fdad" -> null
      - force_destroy          = false -> null
      - id                     = "thalia-thadmin-staging/js/app.e8290908.js" -> null
      - key                    = "js/app.e8290908.js" -> null
      - metadata               = {} -> null
      - region                 = "eu-west-1" -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.e8290908.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.e8290908.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - arn                    = "arn:aws:s3:::thalia-thadmin-staging/js/app.e8290908.js.map" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "645b248a36b50c5aa4b4e2c75390cbfd" -> null
      - force_destroy          = false -> null
      - id                     = "thalia-thadmin-staging/js/app.e8290908.js.map" -> null
      - key                    = "js/app.e8290908.js.map" -> null
      - metadata               = {} -> null
      - region                 = "eu-west-1" -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.e8290908.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.27e84539.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - arn                    = "arn:aws:s3:::thalia-thadmin-staging/js/chunk-vendors.27e84539.js" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "6530e16c67b4415fdeecd22924b8ba37" -> null
      - force_destroy          = false -> null
      - id                     = "thalia-thadmin-staging/js/chunk-vendors.27e84539.js" -> null
      - key                    = "js/chunk-vendors.27e84539.js" -> null
      - metadata               = {} -> null
      - region                 = "eu-west-1" -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.27e84539.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.27e84539.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - arn                    = "arn:aws:s3:::thalia-thadmin-staging/js/chunk-vendors.27e84539.js.map" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "515bc0d61ef79042333d4d2da7d398e3" -> null
      - force_destroy          = false -> null
      - id                     = "thalia-thadmin-staging/js/chunk-vendors.27e84539.js.map" -> null
      - key                    = "js/chunk-vendors.27e84539.js.map" -> null
      - metadata               = {} -> null
      - region                 = "eu-west-1" -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.27e84539.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.e3cf5014.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "975128fb343f5a83958b062b1930cdfe"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.e3cf5014.js"
      + kms_key_id             = (known after apply)
      + region                 = "eu-west-1"
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.e3cf5014.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.e3cf5014.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "0ac9c367ec0a3c5386dea75c29622698"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.e3cf5014.js.map"
      + kms_key_id             = (known after apply)
      + region                 = "eu-west-1"
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.e3cf5014.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>